tutorials/multiphaseEuler/steamInjection/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

massSource
{
    type            massSource;

    phase           steam;

    cellZone
    {
        type            containsPoints;
        points          ((0.075 0.2 0.05));
    }

    massFlowRate
    {
        type            scale;
        scale           squarePulse;
        start           1;
        duration        1e6;
        value           1e-3;
    }
}

phaseChange
{
    type            heatTransferLimitedPhaseChange;
    libs            ("libmultiphaseEulerFvModels.so");

    phases          (steam water);

    energySemiImplicit yes;
    pressureImplicit no;

    saturationTemperature
    {
        type            constant;
        value           372.76;
    }
}

// ************************************************************************* //
